// API иуб - сховища (WEB storage API) включає два основні об"єкти для зберігання даних в браузері користувача: localStorage та sessionStorage. Це прості сховища ключ - значення, схожі на об"єкти, але вони залишаються незмінними під час завантаження сторінки. Ключі та значення завжди є рядками. Відрізняються лише тривалістю збереження даних. 
//  Дані в localStorage зберігаються безстроково, поки користувач не видалить їх вручну або вони не будуть видалені за допомогою коду на сторінці. Приклади застосування localStorage: 
// 1.Зберігання налаштувань користувача, які повинні залишатися між сеансами відвідування сайту. 
// 2.Зберігання токенів аутентифікації користувача для автоматичного входу на сайт.
// 3.Зберігання інформації про кошик покупок або обрані товари.

// Дані в sessionStorage зберігаються тільки протягомодного сеансу відвідування сайту. Сеанс триває,поки вікно або вкладка браузера відкриті. Данівидаляються, коли вікно або вкладказакриваються.Приклади застосування sessionStorage:
// •Зберігання тимчасової інформації прокористувача, яка не повинна зберігатися міжсеансами (наприклад, дані форми, яказаповнюється користувачем).
// •Зберігання стану веб-додатка або відкритихвкладок.
// •Зберігання даних, що використовуються дляреалізації функції "Недавно переглянуті сторінки"або "Назад" в одному сеансі.
  
// Методи JSON (JavaScript Object Notation)
// JSON.parse() Розбирає рядок JSON, можливо з перетворенням одержуваного в процесірозбору значення.
// JSON.stringify()перетворює значення JavaScript в рядок JSON, можливо з заміною значень,якщо вказана функція заміни, або з включенням тільки певних властивостей,якщо зазначений масив заміни.
const jsonString =
` {
"name": "John Doe",
"age": 30,
"isStudent": false,
"courses": ["math", "history", "chemistry"],
"address": { "street": "123 Main St", "city": "New York", "country": "USA" }
}`;
console.log(jsonString);
const jsonObject = JSON.parse(jsonString);
console.log(jsonObject);
const jsonStringified = JSON.stringify(jsonObject);
console.log(jsonStringified);